## Ques1.

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [13]:
import pandas as pd
data = [4,8,15,16,23,42]
series = pd.Series(data)
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

## Ques2.

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [14]:
lst = [1,2,3,4,5,6,7,8,9,10]
series = pd.Series(lst)
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

## Ques3.

In [15]:
data = {
'Name' : ['Alice','Bob','Claire'],
'Age' : [25,30,27],
'Gender' : ['Female', 'Male', 'Female']
}
df = pd.DataFrame(data)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

## Ques4.

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional size-mutable, tabular data structure with columns and rows. It is a fundamental data structure for data analysis in Pandas, and it allows users to handle and manipulate data in a flexible and intuitive way. Each column of a DataFrame is a Series object in Pandas.

A Series is a one-dimensional labeled array that can contain any data type. It is similar to a column in a spreadsheet or a database table. A DataFrame can be thought of as a collection of Series objects where each column represents a Series.

In [16]:
## Series

data_series = pd.Series(['cars', 'bikes', 'boats'])
data_series

0     cars
1    bikes
2    boats
dtype: object

In [17]:
## Dataframe
data_frame = pd.DataFrame({'Vehicle' : ['cars', 'bikes' , 'boats'],
                          'Total_num' : [12,13,14]}) 
data_frame

  Vehicle  Total_num
0    cars         12
1   bikes         13
2   boats         14

## Ques5.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Some functions to manipulate data in a DataFrame are head(), tail(), describe(), groupby(), pivot_table(), fillna(), dropna(), and sort_values().

Example: We can use head() function when we want to display top 5 records(by default) from the starting of the dataframe

## Ques6.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans6).


Series and DataFrame are mutable, which means that their contents can be changed after they are created.

## Ques7.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [18]:
vehicle = pd.Series(['cars', 'bikes', 'boats'])
total_num = pd.Series([12,4,5])
rented = pd.Series(['Yes', 'no', 'yes'])

data_frame = pd.DataFrame({
    'Vehicle' : vehicle, 'Total_num' : total_num, 'Rented' : rented})
    
data_frame

  Vehicle  Total_num Rented
0    cars         12    Yes
1   bikes          4     no
2   boats          5    yes